app/controllers/clientes_controller.rb

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @clientes = Cliente.find (params[:id])

INSERT INTO "clientes" ("rfc", "nombre_cliente", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rfc", 12345], ["nombre_cliente", "Juventino Perez"], ["created_at", "2018-10-22 23:30:39.369271"], ["updated_at", "2018-10-22 23:30:39.369271"]]
---
    def create
        @clientes = Cliente.new(clientes_params)
        if @clientes.save

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @clientes = Cliente.find(params[:id])

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clientes" SET "rfc" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["rfc", 14400984], ["updated_at", "2018-10-24 02:34:12.940449"], ["id", 1]]
---
    def update
        @clientes = Cliente.find(params[:id])
        if @clientes.update(clientes_params)

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 2]]
---
    def destroy
        @clientes = Cliente.find(params[:id])
        @clientes.destroy