app/controllers/ordens_controller.rb

SELECT "ordens".* FROM "ordens"
---
  def index
    @ordens = Orden.all

INSERT INTO "ordens" ("cliente_id", "num_orden", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cliente_id", 1], ["num_orden", 1], ["fecha", "2018-10-24"], ["created_at", "2018-10-24 04:55:45.235779"], ["updated_at", "2018-10-24 04:55:45.235779"]]
---
  def create
    @orden = Orden.new(orden_params)

    respond_to do |format|
      if @orden.save

SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_orden
      @orden = Orden.find(params[:id])