app/controllers/productos_controller.rb

    def show
        @productos = Producto.find (params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def create
        @productos = Producto.new(productos_params)
        if @productos.save
---
INSERT INTO "productos" ("nombre_producto", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre_producto", "Sabritas"], ["precio", 15], ["created_at", "2018-10-22 05:53:00.715240"], ["updated_at", "2018-10-22 05:53:00.715240"]]

    def edit
        @productos = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @productos = Producto.find(params[:id])
        if @productos.update(productos_params)
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "productos" SET "precio" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["precio", 17], ["updated_at", "2018-10-22 06:15:56.974757"], ["id", 1]]

    def destroy
        @productos = Producto.find(params[:id])
        @productos.destroy
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 4]]